onEvent('recipes', (event) => {
    const recipes = [
        {
            // 第一个输入是被使用的方块，第二个输入是使用的物品。
            // 第一个输入如果有数量，则会替代第二个输入物品，但依旧只要求一个，第二个输入的数量，不会生效
            // 第一个输入可以不为方块，如果这么做，则只能用机械手合成
            inputs: ['item','item'],
            // 输出可以有多个物品，除第一个外，玩家右手合成时会以掉落物的方式生成。
            // 如果第一个不是可放置方块，则也会以掉落物方式生成。
            // 输出可以有数量。
            // 玩家右手合成时，第一个输出如果是有数量的方块，则第一个输出仍生成 1 个方块，如果是物品，生成要求输出数量的掉落物。
            // 机械手合成时，无论第一个输出是什么，都会生成对应输出数量的生成物。
            // 其余的输出，无论是玩家右手合成还是机械手合成，都会生成对应输出数量的生成物(玩家右手合成时，都会以掉落物的方式生成)
            output: Item.of('item', value),//输出物品 
            id: 'id'
        },
    ];

    recipes.forEach((recipe) => {
        const re = event.recipes.create.itemApplication(recipe.output, recipe.inputs).id(recipe.id);
    });
});